Repository: vlisivka/egui_pinger
Catalog: locales/*.po
Languages: uk

source: Host name
uk: Імʼя хоста

source: Host address
uk: Адреса хоста

source: Add
uk: Додати

source: DOWN
uk: НЕМА

source: M
uk: С

source: Med
uk: Мд

source: J
uk: Т

source: Jm
uk: Тс

source: Jmed
uk: Тм

source: Av
uk: Дост

source: Out
uk: Аном

source: S
uk: У

source: F
uk: П

source: Str
uk: Сер

source: SD
uk: СВ

source: m/M
uk: м/М

source: L
uk: В

source: Pings
uk: Пінги

source: Confirm Deletion
uk: Підтвердження видалення

source: Are you sure you want to remove this host
uk: Ви впевнені, що хочете видалити цей хост

source: Delete
uk: Видалити

source: Cancel
uk: Скасувати

source: Host Settings
uk: Налаштування хоста

source: Host
uk: Хост

source: Name
uk: Назва

source: Ping Interval:
uk: Інтервал пінгу:

source: Fast (1s)
uk: Швидко (1с)

source: Slow (1m)
uk: Повільно (1хв)

source: Show fields:
uk: Показувати поля:

source: Host Name
uk: Назва хоста

source: Host IP Address
uk: IP-адреса хоста

source: Show the IP address or domain of the host
uk: Показувати IP-адресу або домен хоста

source: Current Latency (Latest RTT)
uk: Поточна затримка (RTT останнього пакета)

source: Show the round-trip time for the last packet
uk: Показувати час проходження останнього пакета

source: Mean RTT (Average latency)
uk: Середній RTT (Середня затримка)

source: Show average latency over the history window
uk: Показувати середню затримку за весь період історії

source: Median RTT (Middle value, robust to spikes)
uk: Медіанний RTT (Середнє значення, стійке до сплесків)

source: Shows values robust to occasional outliers
uk: Показує значення, стійкі до випадкових сплесків

source: RTP Jitter (Current variation per RFC 3550)
uk: RTP Jitter (Поточне тремтіння згідно з RFC 3550)

source: Variation in packet delay (jitter)
uk: Коливання затримки пакетів (джиттер)

source: RTP Jitter Mean (Average variation)
uk: Середній RTP Jitter (Середнє тремтіння за період)

source: Show average jitter over history
uk: Показувати середній джиттер за період історії

source: RTP Jitter Median (Middle variation value)
uk: Медіанний RTP Jitter (Медіана тремтіння)

source: Show median jitter over history
uk: Показувати медіану джиттера за період історії

source: MOS (Estimated Voice Quality, 1.0-4.5)
uk: MOS (Оцінка якості голосу, 1.0-4.5)

source: Calculated Voice Quality (Mean Opinion Score)
uk: Розрахункова якість голосу (Mean Opinion Score)

source: Availability (Packet delivery success rate %)
uk: Доступність (Відсоток доставлених пакетів)

source: Percentage of packets that received a reply
uk: Відсоток пакетів, на які було отримано відповідь

source: Outliers (Packets significantly slower than average)
uk: Аномалії (Пакети з аномально великою затримкою)

source: Number of packets with latency > mean + 3*stddev
uk: Кількість пакетів із затримкою > середня + 3*СВ

source: Streak (Consecutive success/fail count)
uk: Серія (Кількість послідовних успіхів/помилок)

source: Shows current series of successes or failures
uk: Показує поточну серію успішних відповідей або помилок

source: Standard Deviation (RTT stability measure)
uk: Стандартне відхилення (Міра стабільності RTT)

source: Measure of how stable the latency is
uk: Міра стабільності затримки

source: 95th Percentile (Latency for 95% of packets)
uk: 95-й перцентиль (Затримка для 95% пакетів)

source: Worst-case latency for 95% of traffic
uk: Найгірша затримка для 95% трафіку

source: Min / Max (Extreme latency values)
uk: Мін / Макс (Екстремальні значення затримки)

source: Shows absolute minimum and maximum in history
uk: Показує абсолютний мінімум та максимум в історії

source: Loss Statistics (Sent/Lost counters)
uk: Статистика втрат (Лічильники відправлених/втрачених)

source: Shows raw packet counters (sent and lost)
uk: Показує сирі лічильники пакетів (відправлено та втрачено)

source: Close
uk: Закрити

source: Network Statistics Information
uk: Інформація про мережеву статистику

source: Latency
uk: Затримка

source: Jitter
uk: Джиттер

source: Quality & MOS
uk: Якість та MOS

source: Reliability
uk: Надійність

source: Latency (RTT) is the total time it takes for a signal to go from your computer to the server and back. In network diagnostics, this is the most basic measure of 'speed'.
uk: Затримка (RTT) — це повний час, за який сигнал проходить від вашого комп'ютера до сервера і назад. У діагностиці це базовий показник 'швидкості' відгуку мережі.

source: How it is calculated:
uk: Як це розраховується:

source: - Mean (Average): The sum of all RTTs divided by the number of packets. Good for general trends, but can be misleading if you have rare, massive 'lags'.
uk: - Середнє (Mean): Сума всіх значень затримки, поділена на кількість пакетів. Добре показує загальний тренд, але може вводити в оману, якщо є поодинокі, але величезні 'лаги'.

source: - Median (Middle Value): We sort all results and pick the one in the middle. This is the 'typical' experience. If you have 100 packets and 1 of them is very slow, the Median stays the same, while the Mean jumps up.
uk: - Медіана (Median): Ми сортуємо результати й обираємо той, що посередині. Це ваш 'типовий' досвід. Якщо 1 зі 100 пакетів дуже повільний, Медіана не зміниться, тоді як Середнє помітно підскочить.

source: - 95th Percentile (P95): This shows the worst-case scenario for 95% of your traffic. If P95 is low, your connection is stable. If it's much higher than the Median, your connection is 'jittery' and prone to sudden lags.
uk: - 95-й перцентиль (P95): Показує найгірший сценарій для 95% трафіку. Якщо P95 низький — зв'язок стабільний. Якщо він значно вищий за Медіану — канал нестабільний і схильний до раптових підторможувань.

source: VoIP Impact:
uk: Вплив на телефонію:

source: Voice is a real-time stream. If latency is over 150ms, you start to notice a delay in the conversation (waiting for the other person to respond). Above 300ms, people will start 'talking over' each other because of the lag.
uk: Голос — це потік у реальному часі. Якщо затримка понад 150 мс, ви помітите паузи (очікування відповіді співрозмовника). Понад 300 мс — люди почнуть перебивати один одного через запізнення звуку.

source: Jitter - Stability of the Connection
uk: Джиттер — стабільність з'єднання

source: Jitter is the 'shaking' of your latency. It measures how much the delay between packets changes over time.
uk: Джиттер — це 'тремтіння' затримки. Він вимірює, наскільки сильно змінюється час доставки пакетів відносно один одного.

source: We use the RFC 3550 algorithm (Standard for RTP). It doesn't just look at the highest and lowest values; it calculates the difference between consecutive packets and applies a smoothing filter.
uk: Ми використовуємо алгоритм RFC 3550 (стандарт для RTP). Він не просто шукає мінімум і максимум, а вираховує різницю між сусідніми пакетами та застосовує фільтр згладжування.

source: Formally: J = J + (|D| - J) / 16, where D is the difference between the current and previous packet delay. This provides a stable 'moving average' of network stability.
uk: Формально: J = J + (|D| - J) / 16, де D — різниця затримки поточного та попереднього пакетів. Це дає стабільне 'ковзне середнє' мережевої стійкості.

source: Phones expect audio packets to arrive in a steady 'heartbeat' (every 20ms). If Jitter is high (>30ms), packets arrive in 'clumps' or too late to be played. This causes the voice to sound 'robotic', 'choppy', or broken.
uk: Телефони очікують на аудіопакети з рівномірним ритмом (кожні 20 мс). Якщо джиттер високий (>30 мс), пакети приходять 'пачками' або запізно. Це робить голос 'роботизованим' або уривчастим.

source: MOS - The 'Voice Score'
uk: MOS — 'оцінка голосу'

source: MOS (Mean Opinion Score) is a 1.0 to 4.5 rating that predicts how a human would rate the call quality.
uk: MOS (Mean Opinion Score) — це рейтинг від 1.0 до 4.5, який прогнозує, як людина оцінить якість дзвінка.

source: How we calculate it:
uk: Як ми це рахуємо:

source: We implement a simplified ITU-T G.107 'E-model'. It takes your current Latency, Jitter, and Packet Loss, and calculates an 'R-factor'. This factor is then mapped to the MOS scale.
uk: Ми реалізували спрощену 'E-модель' ITU-T G.107. Вона бере затримку, джиттер і втрати, обчислює 'R-фактор', який потім переводиться в шкалу MOS.

source: - 4.3 - 4.5 (Excellent): Crystal clear HD audio, like sitting in the same room.
uk: - 4.3 - 4.5 (Відмінно): Кришталево чистий звук, ніби людина поруч.

source: - 4.0 - 4.2 (Good): Standard clean call. No issues.
uk: - 4.0 - 4.2 (Добре): Стандартний солідний зв'язок без зауважень.

source: - 3.6 - 3.9 (Fair): You can hear 'compression' or minor clicks. Acceptable for business.
uk: - 3.6 - 3.9 (Задовільно): Можна почути 'компресію' або легке клацання. Прийнятно для ділових розмов.

source: - Below 3.0 (Poor): Words are missing, voice is distorted. It's time to hang up and check your router.
uk: - Нижче 3.0 (Погано): Слова зникають, голос спотворений. Час завершувати дзвінок і перевіряти роутер.

source: Reliability - Packet Loss & Outliers
uk: Надійність — втрати та аномалії

source: This tab tracks if packets are actually reaching their destination and if any are 'statistical anomalies'.
uk: Ця вкладка відстежує, чи доходять пакети до цілі та чи є серед них 'статистичні аномалії'.

source: Definitions:
uk: Визначення:

source: - Packet Loss: The most critical metric. If a packet is lost, a piece of someone's word is gone forever. VoIP cannot 'redownload' lost audio like a file transfer does.
uk: - Втрата пакетів: Найкритичніша метрика. Якщо пакет втрачено, частинка слова зникає назавжди. VoIP не може 'перекачати' звук заново, як це робить передача файлів.

source: - Outliers: These are packets that didn't go missing but took much longer than usual (more than 3 standard deviations from the mean). In a call, these cause a temporary 'freeze' or a loud 'pop' in the audio.
uk: - Аномалії (Outliers): Пакети, що не загубилися, але йшли занадто довго (понад 3 стандартні відхилення). У дзвінку це викликає 'фріз' або гучне клацання.

source: - Streak: Shows how many times in a row a host has responded (S) or failed (F). Long 'F' streaks mean the connection is completely down.
uk: - Серія (Streak): Скільки разів поспіль хост відповів (У) чи не відповів (П). Довгі серії 'П' означають повний обрив зв'язку.

source: While 1% loss might be okay for browsing, for VoIP it means every 100th piece of a word is missing. Above 2-3% loss, the conversation becomes extremely difficult to understand.
uk: Втрата 1% може бути непомітною при перегляді сайтів, але для VoIP це кожна 100-та частинка слова. Понад 2-3% втрат роблять розмову нестерпною.
